---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ToposolidTypeDefaultThicknessParam
source: html/1d9c8bb3-3965-cbec-242c-c2ceafc57ded.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ToposolidTypeDefaultThicknessParam Property

"Default Thickness"

## Syntax (C#)
```csharp
public static ForgeTypeId ToposolidTypeDefaultThicknessParam { get; }
```